[Vanguard X2UniversalSoldierClassInfo]
ClassSpecializationTitle="生化前锋"
ClassSpecializationSummary="先锋队是训练有素的生物，擅长利用暗物质场冲锋陷阵。它们是所有生物专业中最物理的，并且非常耐用."

[Tactician X2UniversalSoldierClassInfo]
ClassSpecializationTitle="生化策士"
ClassSpecializationSummary="训练有素的生物，战术家使用各种加成给自己，成为一名全能的优秀士兵。他们具有出色的机动性和生存能力，如果您能负担得起培训，这将是一笔巨大的资产."

[Adept X2UniversalSoldierClassInfo]
ClassSpecializationTitle="生化专家"
ClassSpecializationSummary="作为一名训练有素的生物，熟练者是最初的暗物质使用者。他们扭曲并收割他们的敌人，在原子尺度上撕裂他们。它们使用屏障具有巨大的破坏潜力和良好的生存能力."